package th.co.geniustree.typescript;


import th.co.geniustree.dof.eaquafeed.web.domain.enums.EnumWithValue;

public enum FormType implements EnumWithValue {

    Register("", ""),
    Entrepreneur("", ""),

    LicensingForm1("แบบแจ้งความประสงค์การขอ/ต่ออายุใบอนุญาตผลิต นำเข้า ขาย อาหารสัตว์ควบคุมเฉพาะ", ""),
    LicensingForm2("แบบคำขอใบอนุญาตผลิตอาหารสัตว์ควบคุมเฉพาะ", "มีการแจ้งความประสงค์การขอใบอนุญาต"),
    LicensingForm3("แบบคำขอใบอนุญาตผลิตอาหารสัตว์ควบคุมเฉพาะ", "ไม่มีการแจ้งความประสงค์การขอใบอนุญาต"),
    LicensingForm4("แบบคำขอต่ออายุใบอนุญาตผลิตอาหารสัตว์ควบคุมเฉพาะ", "มีการแจ้งความประสงค์การต่ออายุใบอนุญาต"),
    LicensingForm5("แบบคำขอต่ออายุใบอนุญาตผลิตอาหารสัตว์ควบคุมเฉพาะ", "ไม่มีการแจ้งความประสงค์การต่ออายุใบอนุญาต"),
    LicensingForm6("แบบคำขอแก้ไขใบอนุญาตผลิตอาหารสัตว์ควบคุมเฉพาะ", ""),
    LicensingForm7("แบบคำขอใบแทนใบอนุญาตผลิตอาหารสัตว์ควบคุมเฉพาะ", ""),
    LicensingForm8("แบบคำขอใบอนุญาตนำเข้าอาหารสัตว์ควบคุมเฉพาะ", "มีการแจ้งความประสงค์การขอใบอนุญาต"),
    LicensingForm9("แบบคำขอใบอนุญาตนำเข้าอาหารสัตว์ควบคุมเฉพาะ", "ไม่มีการแจ้งความประสงค์การขอใบอนุญาต"),
    LicensingForm10("แบบคำขอต่ออายุใบอนุญาตนำเข้าอาหารสัตว์ควบคุมเฉพาะ", "มีการแจ้งความประสงค์การต่ออายุใบอนุญาต"),
    LicensingForm11("แบบคำขอต่ออายุใบอนุญาตนำเข้าอาหารสัตว์ควบคุมเฉพาะ", "ไม่มีการแจ้งความประสงค์การต่ออายุใบอนุญาต"),
    LicensingForm12("แบบคำขอแก้ไขใบอนุญาตนำเข้าอาหารสัตว์ควบคุมเฉพาะ", ""),
    LicensingForm13("แบบคำขอใบแทนใบอนุญาตนำเข้าอาหารสัตว์ควบคุมเฉพาะ", ""),
    LicensingForm14("แบบคำขอใบอนุญาตขายอาหารสัตว์ควบคุมเฉพาะ", "มีการแจ้งความประสงค์การขอใบอนุญาต"),
    LicensingForm15("แบบคำขอใบอนุญาตขายอาหารสัตว์ควบคุมเฉพาะ", "ไม่มีการแจ้งความประสงค์การขอใบอนุญาต"),
    LicensingForm16("แบบคำขอต่ออายุใบอนุญาตขายอาหารสัตว์ควบคุมเฉพาะ", "มีการแจ้งความประสงค์การต่ออายุใบอนุญาต"),
    LicensingForm17("แบบคำขอต่ออายุใบอนุญาตขายอาหารสัตว์ควบคุมเฉพาะ", "ไม่มีการแจ้งความประสงค์การต่ออายุใบอนุญาต"),
    LicensingForm18("แบบคำขอแก้ไขใบอนุญาตขายอาหารสัตว์ควบคุมเฉพาะ", ""),
    LicensingForm19("แบบคำขอใบแทนใบอนุญาตขายอาหารสัตว์ควบคุมเฉพาะ", ""),

    VoucherForm1("แบบคำขอขึ้นทะเบียนอาหารสัตว์ควบคุมเฉพาะ ประเภทวัตถุที่ผสมแล้ว ชนิดอาหารสัตว์ผสมสำเร็จรูปหรือหัวอาหารสัตว์", ""),
    VoucherForm2("แบบคำขอแก้ไขรายการขึ้นทะเบียนอาหารสัตว์ควบคุมเฉพาะ ประเภทวัตถุที่ผสมแล้ว ชนิดอาหารสัตว์ผสมสำเร็จรูปหรือหัวอาหารสัตว์", ""),
    VoucherForm3("แบบคำขอขึ้นทะเบียนอาหารสัตว์ควบคุมเฉพาะ ประเภทวัตถุที่ผสมแล้วชนิดสารผสมล่วงหน้า (พรีมิกซ์)", ""),
    VoucherForm4("แบบคำขอแก้ไขรายการขึ้นทะเบียนอาหารสัตว์ควบคุมเฉพาะ ประเภทวัตถุที่ผสมแล้วชนิดสารผสมล่วงหน้า (พรีมิกซ์)", ""),
    VoucherForm5("แบบคำขอขึ้นทะเบียนอาหารสัตว์ควบคุมเฉพาะ ประเภทอาหารเสริมสำหรับสัตว์", ""),
    VoucherForm6("แบบคำขอแก้ไขรายการขึ้นทะเบียนอาหารสัตว์ควบคุมเฉพาะ ประเภทอาหารเสริมสำหรับสัตว์", ""),
    VoucherForm7("แบบคำขอใบแทนใบสำคัญการขึ้นทะเบียนอาหารสัตว์ควบคุมเฉพาะ", ""),

    CertificateForm1("แบบคำขอหนังสือรับรองการขายภายในประเทศ (Certificate of Free Sale) (แบบ รข.1)", ""),
    CertificateForm2("แบบคำขอแก้ไขหนังสือรับรองการขายภายในประเทศ (Certificate of Free Sale)", ""),
    CertificateForm3("แบบคำขอหนังสือรับรองสุขภาพ (Certificate of Health) (แบบ รส.1)", ""),
    CertificateForm4("แบบคำขอแก้ไขหนังสือรับรองสุขภาพ (Certificate of Health)", ""),

    Ns4Form1("แบบคำขอหนังสือแจ้งการนำเข้าซึ่งอาหารสัตว์เข้ามาในราชอาณาจักร (แบบ น.ส.4)", ""),
    Ns4Form2("แบบคำขอแก้ไขหนังสือแจ้งการนำเข้าซึ่งอาหารสัตว์เข้ามาในราชอาณาจักร (แบบ น.ส.4)", ""),

    AuditForm1("แบบคำขอหนังสือสอบถามว่าอาหารสัตว์น้ำเข้าข่ายหรือไม่เข้าข่ายเป็นอาหารสัตว์ควบคุมเฉพาะตาม พรบ.ควบคุมคุณภาพอาหารสัตว์ พ.ศ. 2558", ""),
    ;

    private String formName;
    private String formDesc;

    FormType(String formName, String formDesc) {

        this.formName = formName;
        this.formDesc = formDesc;
    }

    public String getFormName() {
        return formName;
    }

    public void setFormName(String formName) {
        this.formName = formName;
    }

    public String getFormDesc() {
        return formDesc;
    }

    public void setFormDesc(String formDesc) {
        this.formDesc = formDesc;
    }

    @Override
    public String getValue() {
        return formDesc;
    }
}
